# 실수 값을 카테고리 값으로 변환

In [5]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [7]:
bins = [1, 20, 30, 50, 70, 100]
labels =["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)

In [9]:
type(cats) #categorical 클래스 객체가 된다

pandas.core.arrays.categorical.Categorical

In [10]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [11]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [14]:
df = pd.DataFrame(ages, columns=["ages"])
df["age_cat"] = pd.cut(ages, bins, labels=labels)
df

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [20]:
df["age_cat"] = df["age_cat"].astype('str') #dtype이 category로 들어가 있어서 str로

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ages     12 non-null     int64
 1   age_cat  12 non-null     object
dtypes: int64(1), object(1)
memory usage: 320.0+ bytes

# 다중 인덱스

In [6]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [10]:
df3.columns.names = ["Cidx1", "Cidx2"]
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [31]:
df3.stack("Cidx1")

Cidx2      C1    C2
  Cidx1
0 A      1.76  0.40
  B      0.98  2.24
1 A      1.87 -0.98
  B      0.95 -0.15
2 A     -0.10  0.41
  B      0.14  1.45
3 A      0.76  0.12
  B      0.44  0.33
4 A      1.49 -0.21
  B      0.31 -0.85

In [35]:
df3.stack(1)

Cidx1       A     B
  Cidx2
0 C1     1.76  0.98
  C2     0.40  2.24
1 C1     1.87  0.95
  C2    -0.98 -0.15
2 C1    -0.10  0.14
  C2     0.41  1.45
3 C1     0.76  0.44
  C2     0.12  0.33
4 C1     1.49  0.31
  C2    -0.21 -0.85

In [39]:
df3[("A","C1")]

0    1.76
1    1.87
2   -0.10
3    0.76
4    1.49
Name: (A, C1), dtype: float64